ji6czd/momo/momors/crates/momors-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# 手元のボードはチップ改版 v1.3。ESP-IDF v5.5 の既定は v3.01 以上向けで RAM 配置が異なり、
# そのブートローダは v1.x チップでは起動しない。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# v1.x チップは 360MHz 固定。CONFIG_ESP_FORCE_400MHZ_ON_REV_LESS_V3 + ESP_DEFAULT_CPU_FREQ_MHZ_400 を
# 試したが v1.3 では esp_clk_init の assert (clk.c:142) で起動しない（2026-09-04 実測）。

# ---- キャッシュ ----
# モデル（語彙表・CSC・GBDT 木）は PSRAM 常駐でランダムアクセスが多いので L2 を最大に。
CONFIG_CACHE_L2_CACHE_512KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ---- フラッシュ / パーティション ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# パーティション表は espflash 書き込み時に partitions.csv を渡す（.cargo/config.toml の runner 参照）。
# ESP-IDF 側の CONFIG_PARTITION_TABLE_CUSTOM は CMake プロジェクトが out dir に置かれるため使わない。

# ---- PSRAM (32MB) をヒープとして使う ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
# 0 = 大きさにかかわらず PSRAM を優先する。モデルは小さな確保（クラス表の String・GBDT の
# Box ノード・辞書）を大量に行い、既定の 4096 では内部 SRAM 380KB を使い切って
# 直後の pthread mutex 生成で落ちた（2026-09-04 実測）。
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# 内部 SRAM は ESP-IDF の内部専用確保（DMA・FreeRTOS オブジェクト）のために予約する。
# L2 キャッシュ 512KB にすると内部 SRAM は約 160KB しか残らないので、予約は小さめ。
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# ---- スタック ----
# toml/serde の解析と推論バッファのため main タスクは大きめに
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# ---- コンソール: USB-Serial-JTAG ----
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---- 1 文の推論が長引いてもタスク WDT に殺されないようにする ----
CONFIG_ESP_TASK_WDT_INIT=n
